In [1]:
#### 의사결정나무
# 여러 규식을 순차적 적용
# 독립 변수 공간을 분할하는 분류 모델
# *분류와 회귀 활용

In [2]:
# 하나의 독립변수를 선택하고 기준값 설정 = 분류규칙
# 독립변수보다 작은 값 큰 값을 나누고, 하나의 노드만 남을 때까지 반복 실행

In [5]:
from sklearn.datasets import load_iris
import pandas as pd
import seaborn as sns

In [6]:
data = load_iris()
y = data.target
X = data.data[:, 2:]
feature_names = data.feature_names[2:]

from sklearn.tree import DecisionTreeClassifier

tree1 = DecisionTreeClassifier(criterion='entropy', max_depth=1, random_state=0).fit(X, y)

In [9]:
df = pd.DataFrame({
    'city': ['부산', '부산', '부산', '부산', '서울', '서울', '서울'],
    'fruits': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
})
df

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7

In [12]:
df_1 = df.groupby(['city','fruits']).mean()
df_1

             price  quantity
city fruits
부산   apple   100.0       1.0
     banana  275.0       3.5
     orange  200.0       2.0
서울   apple   175.0       5.5
     banana  400.0       7.0